Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: declaration of a conditional capability
ja_jp: 条件付きケイパビリティの宣言

source: declare an observer method, or
ja_jp: オブザーバー・メソッドを宣言するか

source: declares an observer method.
ja_jp: オブザーバーメソッドを宣言している場合。

source: declares an optional Maven dependency on the deployment extension artifact `quarkus-extension-b-deployment`
ja_jp: は、ディプロイメントエクステンションアーティファクト `quarkus-extension-b-deployment` に対するオプションの Maven 依存を宣言します。

source: declares an optional Maven dependency on the runtime extension artifact `quarkus-extension-b`
ja_jp: ランタイムエクステンションアーティファクトに対するオプションのMaven依存関係を宣言 `quarkus-extension-b`

source: define a process variable with name `person` of type `org.acme.kogito.model.Person`
ja_jp: `org.acme.kogito.model.Person` 型の `person` という名前を持つプロセス変数を定義します。

source: define a volume
ja_jp: ボリュームを定義する

source: define the path of source to be copied
ja_jp: コピーするソースのパスを定義する

source: define the simplified target file name to use when copying the file into the `target/asciidoc/examples` directory.
ja_jp: `target/asciidoc/examples` ディレクトリにファイルをコピーする際に使用する簡略化されたターゲットファイル名を定義します。

source: define the simplified target file name to use when copying the file into the `target/asciidoc/examples` directory. We recommend using the same prefix as the related/consuming documentation in the file name.
ja_jp: `target/asciidoc/examples` ディレクトリにファイルをコピーする際に使用する簡略化されたターゲットファイル名を定義します。ファイル名には、関連/消費ドキュメントと同じプレフィックスを使用することをお勧めします。

source: dependencies referenced by `quarkus.index-dependency` in `application.properties`,
ja_jp: `application.properties` の `quarkus.index-dependency` で参照される依存関係

source: dependencies that contain a Jandex index - `META-INF/jandex.idx`,
ja_jp: Jandex インデックスを含む依存関係 (`META-INF/jandex.idx`)

source: dependencies that contain a `beans.xml` descriptor (content is ignored),
ja_jp: `beans.xml` 記述子を含む依存関係 (内容は無視される)

source: describes the concrete steps necessary to complete a task, but these steps could be in the middle of a larger task.
ja_jp: タスクを完了するために必要な手順を具体的に記述していますが、この手順はさらに大きなタスクの途中である可能性があります。

source: designed for containers
ja_jp: コンテナ用に設計

source: dialog: Content will be displayed in a dialog popup
ja_jp: dialog: 内容がダイアログポップアップに表示されます

source: directly embedded in a hidden form input of server-side rendered forms, which are transmitted to and used by the client.
ja_jp: サーバサイドレンダリングフォームの隠しフォーム入力に直接埋め込まれ、クライアントに送信され使用されます。

source: directly on a reactive messaging method - this method will be considered _blocking_ and executed on a virtual thread
ja_jp: リアクティブメッセージングメソッドで直接使用 - このメソッドはブロッキングとみなされ、仮想スレッドで実行されます。

source: discuss with us on https://quarkusio.zulipchat.com/[Zulip] and on the https://groups.google.com/d/forum/quarkus-dev[mailing list];
ja_jp: https://quarkusio.zulipchat.com/[Zulip] や https://groups.google.com/d/forum/quarkus-dev[メーリングリスト] でディスカッションに参加

source: do not explain concepts, they rely on other documents (like concepts) to do that.
ja_jp: コンセプトの説明は他のドキュメント (コンセプトなど) に任せて省略します。

source: do not teach, instruct or include reference information. If you need to refer to a tutorial, how-to, or reference guide, point the reader to where they can find it, but do not replicate that information directly in your concept guide.
ja_jp: 指導、指示、参考情報の記載はしません。チュートリアル、ハウツー、リファレンスガイドなどを参照する必要がある場合は、それがある場所を示しますが、情報をコンセプトガイドに直接コピーすることはしません。

source: does not declare any producer which is eligible for injection to any injection point in the dependency tree, and
ja_jp: 依存関係ツリーのどの注入ポイントにも注入可能なプロデューサーを宣言していないこと

source: don't forget to configure your compiler to generate parameter name information with `-parameters` (javac) or `<parameters>` or `<maven.compiler.parameters>` (https://maven.apache.org/plugins/maven-compiler-plugin/compile-mojo.html#parameters[Maven]).
ja_jp: パラメーター名の情報を生成するために、 `-parameters` (javac) または `<parameters>` または `<maven.compiler.parameters>` (https://maven.apache.org/plugins/maven-compiler-plugin/compile-mojo.html#parameters[Maven]) を使ってコンパイラーを設定することを忘れないでください。

source: double click on the business rule task
ja_jp: ビジネスルールタスクをダブルクリックします

source: double click on the gateway
ja_jp: ゲートウェイをダブルクリックします

source: double click on the user task
ja_jp: ユーザータスクをダブルクリックします

source: double-click on the business rule task
ja_jp: ビジネスルールタスクをダブルクリックする

source: double-click on the gateway
ja_jp: ゲートウェイをダブルクリックする

source: double-click on the user task
ja_jp: ユーザータスクをダブルクリックする

source: drag a Decision node from the palette, name it `Base price` and assign it the type `number` using the Properties panel.
ja_jp: パレットからDecision ノードをドラッグし、 `Base price` という名前を付け、プロパティパネルで `number` というタイプを割り当てます。

source: drag a Decision node from the palette, name it `Base price` and assign it type `number` using the Properties panel.
ja_jp: パレットからDecision ノードをドラッグし、 `Base price` という名前を付け、プロパティパネルで `number` というタイプを割り当てます。

source: drag an InputData node from the palette, name it `Age` and assign it the type `number` using the Properties panel.
ja_jp: パレットからInputDataノードをドラッグし、 `Age` という名前を付け、プロパティパネルで `number` というタイプを割り当てます。

source: drag an InputData node from the palette, name it `Age` and assign it type `number` using the Properties panel.
ja_jp: パレットからInputDataノードをドラッグし、 `Age` という名前を付け、プロパティパネルで `number` というタイプを割り当てます。

source: drag an InputData node from the palette, name it `Previous incidents?` and assign it the type `boolean` using the Properties panel.
ja_jp: パレットからInputDataノードをドラッグし、 `Previous incidents?` という名前を付け、プロパティパネルで `boolean` というタイプを割り当てます。

source: drag an InputData node from the palette, name it `Previous incidents?` and assign it type `boolean` using the Properties panel.
ja_jp: パレットからInputDataノードをドラッグし、 `Previous incidents?` という名前を付け、プロパティパネルで `boolean` というタイプを割り当てます。

source: drag the End Events -> End from the palette and drop it next to the gateway, link it with the user task
ja_jp: パレットからEnd Events -> Endをドラッグして、ゲートウェイの横にドロップして、ユーザータスクとリンクさせます。

source: drag the End Events -> End from the palette and drop it next to the user task, link it with the user task
ja_jp: パレットからEnd Events -> Endをドラッグして、ユーザータスクの横にドロップして、ユーザータスクとリンクさせます。

source: drag the Gateways -> XOR gateway from the palette and drop it next to the business rule task, link it with rule task
ja_jp: パレットからGateways -> XOR gatewayをドラッグして、ビジネスルールタスクの横にドロップし、ルールタスクとリンクさせます。

source: drag the Tasks -> Business Rule Task from the palette and drop it next to start event, link it with start event
ja_jp: タスク→ビジネスルールタスクをパレットからドラッグしてスタートイベントの横にドロップし、スタートイベントとリンクさせます。

source: drag the Tasks -> User Task from the palette and drop it next to the gateway, link it with gateway
ja_jp: パレットからTasks -> User Taskをドラッグしてゲートウェイの横にドロップし、ゲートウェイと連携させます。

source: during notification of a synchronous observer method.
ja_jp: 同期オブザーバメソッドの通知中

source: dynamic (loaded at runtime) `.dynamicLabelJsonRPCMethodName("yourJsonRPCMethodName")`
ja_jp: 動的 (実行時にロード) `.dynamicLabelJsonRPCMethodName("yourJsonRPCMethodName")`

source: e.g.
ja_jp: 例

source: e.g.,
ja_jp: 例えば、

source: each field of the response type has to be annotated with `@PartType` - fields without this annotation are ignored
ja_jp: 応答型の各フィールドには `@PartType` アノテーションを付ける必要があります - このアノテーションのないフィールドは無視されます

source: each instance requires dedicated storage for the coordinators' transaction logs (since sharing transaction stores is not currently supported).
ja_jp: 各インスタンスには、コーディネーターのトランザクションログ用の専用ストレージが必要です（現在、トランザクションストアの共有はサポートされていないため）。

source: each with its own configuration.
ja_jp: それぞれが独自の設定を持っています。

source: easier upgrades.
ja_jp: アップグレードの容易化。

source: either `quarkus-resteasy-qute` if you are using RESTEasy Classic:
ja_jp: RESTEasy Classicを使用している場合は、 `quarkus-resteasy-qute` か:

source: either `quarkus-resteasy-reactive-qute` if you are using RESTEasy Reactive:
ja_jp: RESTEasy Reactive を使用している場合は `quarkus-resteasy-reactive-qute`:

source: email
ja_jp: メール

source: empty footnote:[By default the configured category gets the same handlers attached as the one on the root logger.]
ja_jp: empty footnote:[デフォルトでは設定されたカテゴリはルートロガーにアタッチされたハンドラーと同じものを受け取ります。]

source: empty footnote:[By default, the configured category gets the same handlers attached as the one on the root logger.]
ja_jp: empty footnote:[デフォルトでは設定されたカテゴリはルートロガーにアタッチされたハンドラーと同じものを受け取ります。]

source: enable the _development mode_ (hot reload)
ja_jp: _development mode_ (ホットリロード) を有効にする方法

source: end events
ja_jp: エンドイベント

source: environment variables were retained.
ja_jp: 環境変数は保持されました。

source: equivalent to `{item.name}` but using the bracket notation
ja_jp: `{item.name}` と同じですが、ブラケット表記を使います。

source: establish an `InformationRequirement` edge from `Age` to `Base price` nodes, by using the node palette by mouse overing near the element in the graph.
ja_jp: グラフ内の要素の近くにマウスオーバーしてノードパレットを使用し、 `Age` ノードから `Base price` ノードへの `InformationRequirement` エッジを確立します。

source: establish an `InformationRequirement` edge from `Previous incidents?` to `Base price` nodes, by using the node palette by mouse overing near the element in the graph.
ja_jp: グラフ内の要素の近くにマウスオーバーしてノードパレットを使用し、 `Previous incidents?` ノードから `Base price` ノードへの `情報要件` を接続します。

source: etc
ja_jp: その他

source: example `Dockerfile` files for both `native` and `jvm` modes
ja_jp: `native` と `jvm` の両方のモードに対応した `Dockerfile` ファイルの例

source: example `Dockerfile` files for both `native` and `jvm` modes in `src/main/docker`
ja_jp: `src/main/docker` に配置される `native` と `jvm` の両方のモード用の `Dockerfile` ファイルの例

source: example application.properties file section for embedded realm
ja_jp: 例: 埋め込みレルム用のapplication.propertiesファイルセクション

source: example application.properties file section for property files realm
ja_jp: プロパティーファイル realm の application.properties ファイルセクション

source: example test-roles.properties file
ja_jp: 例:test-roles.propertiesファイル

source: example test-users.properties file
ja_jp: 例:test-users.propertiesファイル

source: exception mappers defined in REST endpoint classes will only be called if the exception is thrown in the same class. If you want to define global exception mappers, simply define them outside a REST endpoint class:
ja_jp: REST エンドポイントクラスで定義された例外マッパーは、例外が同じクラスで出力された場合にのみ呼び出されます。グローバル例外マッパーを定義する場合は、REST エンドポイントクラスの外部で定義するだけです。

source: exclusive gateway
ja_jp: 専用ゲートウェイ

source: execute it with `./target/rest-json-quickstart-1.0.0-SNAPSHOT-runner`
ja_jp: `./target/rest-json-quickstart-1.0-SNAPSHOT-runner` で実行します。

source: execute non adult use case
ja_jp: ノンアダルトユースケースを実行する

source: explicit blocking - https://smallrye.io/smallrye-mutiny/guides/imperative-to-reactive
ja_jp: 明示的ブロッキング - https://smallrye.io/smallrye-mutiny/guides/imperative-to-reactive

source: explicit blocking - https://smallrye.io/smallrye-mutiny/latest/guides/imperative-to-reactive/
ja_jp: 明示的ブロッキング - https://smallrye.io/smallrye-mutiny/latest/guides/imperative-to-reactive/

source: explicitly disable Dev Services and enable Dev Resources and use less-heavy concept of starting and stopping Dev Resources
ja_jp: 明示的に Dev Service を無効にして Dev Resource を有効にし、Dev Resource の開始と停止のより簡単な概念を使用する

source: explicitly disable both Dev Services and Dev Resources, and use Quarkus' `@QuarkusTestResource` testing concept (see Note)
ja_jp: Dev Service と Dev Resource の両方を明示的に無効にし、Quarkus の `@QuarkusTestResource` テストコンセプトを使用する (注記を参照)

source: expose the fact that a database configuration exists
ja_jp: データベース設定が存在することを明らかにする

source: exposing an HTTP endpoint,
ja_jp: HTTPエンドポイントを公開している

source: extension
ja_jp: エクステンション

source: extensions can produce a list of classes (using the `io.quarkus.deployment.builditem.PreloadClassBuildItem` build item)
ja_jp: エクステンションは、クラスのリストを生成することができます ( `io.quarkus.deployment.builditem.PreloadClassBuildItem` ビルドアイテムを使用します)。

source: extensions with dependency conditions present in their metadata could still appear as regular dependencies in Maven `pom.xml` and Gradle build scripts, in which case their conditions will simply be ignored.
ja_jp: メタデータに依存関係条件が存在するエクステンションは、Maven の `pom.xml` および Gradle ビルドスクリプトで通常の依存関係として表示される可能性があります。その場合、その条件は単に無視されます。

source: file or directory (`file:`)
ja_jp: ファイルまたはディレクトリー (`file:`)

source: files sent in multipart responses can only be parsed to `File`, `Path` and `FileDownload`
ja_jp: マルチパート応答で送信されたファイルは、 `File`、 `Path`、および `FileDownload` にのみ解析できます。

source: filter extensions
ja_jp: エクステンションのフィルタリング

source: focus on explaining a topic. Their goal is to help the reader understand the concept.
ja_jp: トピックを説明することに重点を置いています。読者がコンセプトを理解できるよう支援することを目的としています。

source: focus on one way of doing the task. Alternative approaches are explored in other document types (a how-to guide, for example).
ja_jp: タスクを実行するための 1 つの方法に焦点を当てます。それ以外の方法は、他のタイプのドキュメント (例: ハウツーガイド) で説明しています。

source: focus on one way of doing the task. Alternative approaches are explored in other document types (e.g. a how-to guide).
ja_jp: タスクを実行するための 1 つの方法に焦点を当てます。それ以外の方法は、他のタイプのドキュメント (例: ハウツーガイド) で説明しています。

source: for multi-pipelines it works similarly:
ja_jp: マルチパイプラインの場合も同様です：

source: from `quarkus` (Quarkus Core) or `quarkus/extensions` directory, it will use the 'Quarkus Core' extension layout and defaults.
ja_jp: `quarkus` (Quarkus Core) または `quarkus/extensions` ディレクトリからアクセスすると、'Quarkus Core' エクステンションのレイアウトとデフォルトが使用されます。

source: from the `ExtensionsResourceTest` class.
ja_jp: `ExtensionsResourceTest` クラスから。

source: full-text
ja_jp: フルテキスト

source: further Blaze-Persistence integrations as needed:
ja_jp: 必要に応じて、さらにBlaze-Persistenceの統合を行います:

source: gRPC Client metrics
ja_jp: gRPCクライアントのメトリクス

source: gRPC Headers
ja_jp: gRPCヘッダー

source: gRPC Java client only support the `PEM` format for the trust-store.
ja_jp: gRPC Java クライアントは、トラストストアに対して `PEM` 形式のみをサポートします。

source: gRPC Server authorization
ja_jp: gRPC サーバーの認可

source: gRPC Server metrics
ja_jp: gRPCサーバーのメトリクス

source: gRPC allows receiving and returning streams:
ja_jp: gRPCでは、ストリームを受信して返すことができます。

source: gRPC allows sending and receiving streams:
ja_jp: gRPCでは、ストリームの送受信が可能です。

source: gRPC classes from dependencies
ja_jp: 依存関係にあるgRPCクラス

source: gRPC client metrics are automatically enabled when the application also uses the xref:micrometer.adoc[`quarkus-micrometer`] extension. Micrometer collects the metrics of all the gRPC clients used by the application.
ja_jp: アプリケーションがxref:micrometer.adoc[ `quarkus-micrometer` ]エクステンションを使用している場合、gRPCクライアント・メトリクスが自動的に有効になります。Micrometerは、アプリケーションが使用するすべてのgRPCクライアントのメトリクスを収集します。

source: gRPC client metrics are automatically enabled when the application also uses the xref:telemetry-micrometer.adoc[`quarkus-micrometer`] extension. Micrometer collects the metrics of all the gRPC clients used by the application.
ja_jp: gRPC クライアント・メトリクスは、アプリケーションもエクステンションを使用する場合に自動的に有効になります。 xref:telemetry-micrometer.adoc[`quarkus-micrometer`] エクステンションを使用している場合、gRPC クライアント・メトリクスは自動的に有効になります。micrometerは、アプリケーションが使用するすべてのgRPCクライアントのメトリクスを収集します。

source: gRPC clients can be injected in your application code.
ja_jp: gRPCクライアントは、アプリケーションコードにインジェクトすることができます。

source: gRPC code generation reference guide
ja_jp: gRPCコード生成リファレンスガイド

source: gRPC endpoint for sending spans
ja_jp: スパンを送信するためのgRPCエンドポイント

source: gRPC endpoint to send spans. If not set, it will default to `http://localhost:4317`.
ja_jp: スパンを送信するためのgRPCエンドポイント。設定されていない場合、デフォルトは `http://localhost:4317` .

source: gRPC endpoint to send the logs. If not set, it will default to `http://localhost:4317`.
ja_jp: ログを送信する gRPC エンドポイント。設定されていない場合は、 `http://localhost:4317` がデフォルトです。

source: gRPC endpoint to send the metrics. If not set, it will default to `http://localhost:4317`.
ja_jp: メトリクスを送信するための gRPC エンドポイント。 設定されていない場合、デフォルトは `http://localhost:4317` です。

source: gRPC endpoint to send the telemetry. If not set, it will default to `http://localhost:4317`.
ja_jp: テレメトリを送信する gRPC エンドポイント。設定されていない場合、デフォルトは `http://localhost:4317` .

source: gRPC generation provides several stubs, providing different ways to consume a gRPC service. You can inject:
ja_jp: gRPCの生成には、いくつかのスタブが用意されており、gRPCサービスを使用するためのさまざまな方法を提供しています。下記をインジェクトすることができます。

source: gRPC reference guide
ja_jp: gRPCリファレンスガイド

source: gRPC server interceptors let you perform logic, such as authentication, before your service is invoked.
ja_jp: gRPCサーバーのインターセプターでは、サービスが呼び出される前に、認証などのロジックを実行することができるようになります。

source: gRPC server metrics are automatically enabled when the application also uses the xref:micrometer.adoc[`quarkus-micrometer`] extension. Micrometer collects the metrics of all the gRPC services implemented by the application.
ja_jp: アプリケーションが xref:micrometer.adoc[ `quarkus-micrometer`] エクステンションを使用している場合、gRPCサーバーメトリクスが自動的に有効になります。Micrometerは、アプリケーションが実装するすべてのgRPCサービスのメトリクスを収集します。

source: gRPC server metrics are automatically enabled when the application also uses the xref:telemetry-micrometer.adoc[`quarkus-micrometer`] extension. Micrometer collects the metrics of all the gRPC services implemented by the application.
ja_jp: アプリケーションが xref:telemetry-micrometer.adoc[`quarkus-micrometer`] エクステンションも使用している場合、gRPCサーバーのメトリクスは自動的に有効になります。 Micrometerは、アプリケーションが実装するすべてのgRPCサービスのメトリクスを収集します。

source: gRPC service implementations exposed as CDI beans are automatically registered and served by quarkus-grpc.
ja_jp: CDI Beanとして公開されたgRPCサービスの実装は、quarkus-grpcによって自動的に登録、提供されます。

source: gRPC: implement and consume gRPC services. Offer reactive and imperative programming interfaces.
ja_jp: gRPC: gRPCサービスを実装し、消費します。反応型および命令型のプログラミング・インターフェースを提供。

source: generally reinstall your brew dependencies with native compilation
ja_jp: 通常は、ネイティブコンパイルで brew の依存関係を再インストールします。

source: generate extension metadata;
ja_jp: エクステンションメタデータを生成します。

source: get the reader started (they do not create an expert).
ja_jp: 読者が開始できるように促します (エキスパートを育成するものではありません)。

source: global client proxy settings, with `quarkus.rest-client.proxy-address`, `quarkus.rest-client.proxy-user`, `quarkus.rest-client.proxy-password`, `quarkus.rest-client.non-proxy-hosts`
ja_jp: グローバルクライアントプロキシー設定、 `quarkus.rest-client.proxy-address`、 `quarkus.rest-client.proxy-user`、 `quarkus.rest-client.proxy-password`、 `quarkus.rest-client.non-proxy-hosts`

source: graph
ja_jp: グラフ

source: graph - `.graph()` (requires the https://redis.com/modules/redis-graph/[RedisGraph] module on the server side). These commands are marked as experimental. Also the module has been declared _end of life_ by https://redis.com/blog/redisgraph-eol/[Redis].
ja_jp: graph - `.graph()` (サーバー側に link:https://redis.com/modules/redis-graph/[RedisGraph] モジュールが必要)。 これらのコマンドは実験的なものです。 また、このモジュールは link:https://redis.com/blog/redisgraph-eol/[Redis] によって _終了_ が 宣言されています。

source: guide (walk-through) or demonstrate how to complete a task.
ja_jp: タスクを完了する方法をガイド (手順) または実演します。

source: has a name designated via `@Named`, or
ja_jp: `@Named` を通して指定された名前を持っているか、

source: has a start tag
ja_jp: 開始タグがあります。

source: has launched.
ja_jp: 登場.

source: has to be registered via `src/main/resources/META-INF/services/io.quarkus.test.junit.callback.QuarkusTestBeforeEachCallback` as follows:
ja_jp: 次のように、 `src/main/resources/META-INF/services/io.quarkus.test.junit.callback.QuarkusTestBeforeEachCallback` を介して登録する必要があります。

source: hasJWT is false
ja_jp: hasJWTは false です。

source: have a name designated via `@Named`, or
ja_jp: `@Named` を通して指定された名前を持っているか

source: hello.txt
ja_jp: hello.text

source: here set the `topbar` background color.
ja_jp: ここでは `topbar` の背景色を設定します。

source: here we use a manually created implementation of the client interface to replace the actual Client
ja_jp: ここでは、手動で作成したクライアントインターフェイスの実装を使用して、実際のクライアントを置き換えます

source: hibernate
ja_jp: Hibernate ORM

source: hibernate-orm
ja_jp: 冬眠虫

source: hit `Ctrl+C` to stop the application
ja_jp: `Ctrl+C` でアプリケーションを停止させます。

source: how often a negative number was checked: `type="not-natural"`
ja_jp: 負の数がチェックされた頻度: `type="not-natural"`

source: how often a non-prime number was checked: `type="not-prime"`
ja_jp: 非素数がチェックされた頻度: `type="not-prime"`

source: how often a prime number was checked: `type="prime"`
ja_jp: 素数がチェックされた頻度: `type="prime"`

source: how often an even number was checked: `type="even"`
ja_jp: 偶数がチェックされた頻度: `type="even"`

source: how often the number one was checked: `type="one"`
ja_jp: 1 がチェックされた頻度: `type="one"`

source: how to compile your application natively
ja_jp: アプリケーションをネイティブコンパイルする方法

source: how to create and scaffold a new project
ja_jp: プロジェクトを新規作成してスキャフォールドする方法

source: how to deal with extensions
ja_jp: エクステンションの取り扱い

source: how to develop your application in your IDE
ja_jp: IDE でアプリケーションを開発する方法

source: how to enable live reload
ja_jp: ライブリロードを有効にする方法

source: how to obtain a reference to those datasources in code
ja_jp: コードでこれらのデータソースへの参照を取得する方法

source: how to set up Quarkus tools in xref:ide-tooling.adoc[Visual Studio Code, Eclipse IDE, Eclipse Che and IntelliJ IDEA]
ja_jp: xref:ide-tooling.adoc[Visual Studio Code、Eclipse IDE、Eclipse Che、IntelliJ IDEA]でQuarkusツールをセットアップする方法

source: how to setup Quarkus tools in xref:ide-tooling.adoc[Visual Studio Code, Eclipse IDE, Eclipse Che and IntelliJ]
ja_jp: xref:ide-tooling.adoc[Visual Studio Code、Eclipse IDE、Eclipse Che、IntelliJ] でQuarkusツールを設定する方法

source: how to use the xref:cli-tooling.adoc[CLI] for your toolchain
ja_jp: ツールチェインとしての link:cli-tooling[CLI] の使用法

source: how to use xref:gradle-tooling.adoc[Gradle] as a build tool
ja_jp: ビルドツールとしての link:gradle-tooling[Gradle] の使い方

source: how to use xref:maven-tooling.adoc[Maven] as a build tool
ja_jp: ビルドツールとしての link:maven-tooling[Maven] の使い方

source: how we measure memory usage
ja_jp: メモリ使用量の測定方法

source: how we measure startup time
ja_jp: 起動時間の測定方法

source: html: This will display interperated html
ja_jp: html: これにより、解釈された HTML が表示されます

source: http resource (`http:`)
ja_jp: http リソース (`http:`)

source: http://asciidoctor.org/docs/asciidoc-syntax-quick-reference/[AsciiDoc Syntax Quick Reference]
ja_jp: link:http://asciidoctor.org/docs/asciidoc-syntax-quick-reference/[AsciiDocシンタックスクイックレファレンス]

source: http://camel.apache.org/[Apache Camel] is the Swiss knife of integrating heterogeneous systems with more than a decade of history and a lively community of users and developers.
ja_jp: link:http://camel.apache.org/[Apache Camel]は、10年以上の歴史とユーザーや開発者の活発なコミュニティを持つ、異種システムを統合するためのスイスアーミーナイフです。

source: http://localhost:8080/hello/Quarkus/array returns:
ja_jp: http://localhost:8080/hello/Quarkus/array は次を返却します

source: http://localhost:8080/hello/Quarkus/object returns:
ja_jp: http://localhost:8080/hello/Quarkus/object は次を返却します

source: http://red.ht/mta[MTA web page] (with downloads and demo videos)
ja_jp: link:http://red.ht/mta[MTAのWebページ]（ダウンロード、デモビデオあり）

source: https://a2a-protocol.org/latest/specification/[A2A Specification]
ja_jp: https://a2a-protocol.org/latest/specification/[A2A 仕様]

source: https://azure.microsoft.com[An Azure Account]. Free accounts work.
ja_jp: link:https://azure.microsoft.com[Azureのアカウント] 無料アカウントでも大丈夫です。

source: https://blog.marcnuri.com/react-quarkus-integration-using-maven[React + Quarkus integration using Maven]
ja_jp: link:https://blog.marcnuri.com/react-quarkus-integration-using-maven[Mavenを使用したReact + Quarkusの統合]

source: https://brew.sh[Homebrew] is a package manager for macOS (and Linux).
ja_jp: https://brew.sh[Homebrew] は、macOS (および Linux) 向けのパッケージマネージャーです。

source: https://camel.apache.org/[Apache Camel] is the Swiss knife of integrating heterogeneous systems with more than a decade of history and a lively community of users and developers.
ja_jp: link:http://camel.apache.org/[Apache Camel]は、10年以上の歴史とユーザーや開発者の活発なコミュニティを持つ、異種システムを統合するためのスイスアーミーナイフです。
